artifacts/stage2/confirm-r1-c4/round1-input512-concurrency4.log
WARNING 09-08 16:15:06 [config.py:71] Support for Transformers v4 is deprecated. The Transformers v4 codepath will become unmaintained in vLLM v0.22.0 and will be removed in vLLM v0.24.0. Please upgrade to Transformers v5: pip install --upgrade transformers
WARNING 09-08 16:15:07 [interface.py:757] Using 'pin_memory=False' as WSL is detected. This may slow down the performance.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x79ae5ee4e3e0>, trust_remote_code=False, seed=42, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=128, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='/home/lunacia/.cache/huggingface/models--Qwen--Qwen3-4B/snapshots/1cfa9a7208912126459214e8b04321603b3df60c', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=4, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/mnt/d/Lunacia/Inference/artifacts/stage2/confirm-r1-c4', result_filename='round1-input512-concurrency4.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,e2el', metric_percentiles='50,95', goodput=None, request_id_prefix='bench-5e1f91b0-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='qwen3-4b-baseline', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-08 16:15:08 [utils.py:90] Sampling input_len from [512, 512] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 4 requests...
100%|██████████| 4/4 [00:03<00:00,  1.27it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|██████████| 32/32 [00:22<00:00,  1.44it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32        
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  23.27     
Total input tokens:                      16384     
Total generated tokens:                  4096      
Request throughput (req/s):              1.38      
Output token throughput (tok/s):         176.03    
Peak output token throughput (tok/s):    200.00    
Peak concurrent requests:                8.00      
Total token throughput (tok/s):          880.14    
---------------Time to First Token----------------
Mean TTFT (ms):                          230.02    
Median TTFT (ms):                        270.92    
P50 TTFT (ms):                           270.92    
P95 TTFT (ms):                           299.32    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          21.02     
Median TPOT (ms):                        20.81     
P50 TPOT (ms):                           20.81     
P95 TPOT (ms):                           22.34     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2899.68   
Median E2EL (ms):                        2877.61   
P50 E2EL (ms):                           2877.61   
P95 E2EL (ms):                           3011.67   
==================================================